/* Exercise_Ch14_05.c --  */

/*
 *  编写一个程序满足下面的要求。
 *  a. 外部定义一个有两个成员的结构模板 name：一个字符串存储名，一个字符串存储姓。
 *  b. 外部定义一个有3个成员的结构模板student：一个name类型的结构，
 *    一个grade数组存储3个浮点型分数，一个变量存储3个分数平均值。
 *  c. 在main()函数中声明一个内含CSIZE（CSIZE=4）个student类型结构的数组，
 *    并初始化这些结构的名字部分。用函数执行d、e、f和g中描述的任务。
 *  d. 以交互的方式获取每个学生的成绩，提示用户输入学生的姓名和分数。
 *    把分数存储到grade数组相应的结构中。可以在main()函数或其他函数中用循环来完成。
 *  e. 计算每个结构的平均分，并把计算后的值赋给合适的成员。
 *  f. 打印每个结构的信息。
 *  g. 打印班级的平均分，即所有结构的数值成员的平均值。
 */

/*
 *  
 *  
 */

 #include <stdio.h>

 int main(void)
 {

    return 0;
 }
