/* Exercise_Ch08_07.c --  */

/*
 *  修改第7章的编程练习8，用字符代替数字标记菜单的选项。用q代替5作为结束输入的标记。
 * */

/*
 *  第 7 章中的编程练习8 给出了一个可供选择的工资等级清单。使用 switch 完成工资等级选择。
 *  本题要求：使用字符代替数字来标记菜单选项，显示的菜单如下：
 *  ***********************************************************************
 *  Enter the number corresponding to the desired pay rate or action
 *  a) $8.75/hr                             b) $9.33/hr
 *  c) $10.00/hr                            d) $11.20/hr
 *  q) Quit
 *  ***********************************************************************
 *  使用 getchar() 函数读取标准输入，需要注意的是数据输入缓冲区的清除，
 *  例如，多输入字符、换行等等。
 * */

